src/cf/Documents/ЗакрытиеСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗакрытиеСделки</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрибылиУбытки</xr:Item>
				<xr:Item>AccumulationRegister.ОткрытыеПозиции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСовершенияСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособСовершенияСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииТестов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтопПриказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ПрибылиУбытки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ПрибылиУбытки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСовершенияСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособСовершенияСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяМодель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеМодели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииТестов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеСделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ОткрытыеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>ОткрытыеПозиции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияТестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииТестов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/НаправлениеСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>НаправлениеСделки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗакрытиеСделки/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Сделка") Тогда
		// Заполнение шапки
		Основание = ДанныеЗаполнения.Ссылка;
		Инструмент = ДанныеЗаполнения.Инструмент;
		Коментарий = ДанныеЗаполнения.Коментарий;
		НаправлениеСделки = ?(Основание.НаправлениеСделки = Перечисления.НаправлениеСделки.Покупка,Перечисления.НаправлениеСделки.Продажа,Перечисления.НаправлениеСделки.Покупка);
		СерияТестирования = ДанныеЗаполнения.СерияТестирования;
		СпособСовершенияСделки = ДанныеЗаполнения.СпособСовершенияСделки;
		
		Счет = ДанныеЗаполнения.Счет;
		
		Для Каждого ТекСтрокаПараметры Из ДанныеЗаполнения.Параметры Цикл
			НоваяСтрока = Параметры.Добавить();
			НоваяСтрока.Дата = ТекСтрокаПараметры.Дата;
			НоваяСтрока.Количество = ТекСтрокаПараметры.Количество;
			НоваяСтрока.КомиссияБиржи = ТекСтрокаПараметры.КомиссияБиржи;
			НоваяСтрока.КомиссияБрокера = ТекСтрокаПараметры.КомиссияБрокера;
			НоваяСтрока.НомерСделки = ТекСтрокаПараметры.НомерСделки;
			НоваяСтрока.Сумма = ТекСтрокаПараметры.Сумма;
			НоваяСтрока.Цена = ТекСтрокаПараметры.Цена;
			НоваяСтрока.ЦенаСтопПриказа = ТекСтрокаПараметры.ЦенаСтопПриказа;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрибылиУбытки Расход
	Движения.ПрибылиУбытки.Записывать = Истина;
	Движение = Движения.ПрибылиУбытки.Добавить();
	Если Основание.НаправлениеСделки = Перечисления.НаправлениеСделки.Покупка Тогда	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;	
	Иначе	
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Движение.Период = Дата;
	Движение.Основание = Основание;
	Движение.Инструмент = Инструмент;
	Движение.Счет = Счет;
	Движение.СпособСовершенияСделки = СпособСовершенияСделки;
	Движение.СерияТестирования = СерияТестирования;
	Движение.НаправлениеСделки = НаправлениеСделки;
	
	Для каждого Строка Из Параметры Цикл
		Движение.Сумма = Движение.Сумма +Строка.Сумма ;	
	КонецЦикла;

	
	// регистр ОткрытыеПозиции Расход
	
		
	Движения.ОткрытыеПозиции.Записывать = Истина;
	
	Движение = Движения.ОткрытыеПозиции.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Инструмент = Инструмент;
	Для каждого Строка Из  Параметры Цикл		
		Движение.Количество = Движение.Количество + Строка.Количество;			
	КонецЦикла;
		
	Движение.Счет = Счет;
   	Движение.СерияТестирования = СерияТестирования;



	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
